use super::{CapacityCategory, CapacityCategoryInterpretation};

pub(super) const CAPACITY_CATEGORY_INTERPRETATIONS: [CapacityCategoryInterpretation; 6] = [
    CapacityCategoryInterpretation {
        capacity_category: CapacityCategory::R,
        name: "现实型",
        personality_trait: "“安分随流、直率坦诚、实事求是、循规蹈矩、坚忍不拔、勤劳节俭”是对这类人较好的描述。他们的动手能力较强，喜欢与机器、工具打交道，喜欢实际操作，做事喜欢遵循一定的规则。他们做人很现实，不是个理想主义者，并且追求安定、舒适的生活。但是。这类人通常表达能力不强，不善与人交际，思想较保守，对新鲜事物不太感兴趣，情感体验也不太丰富，他们的生活也许缺少一些情趣。",
        occupational_stigma: "需要进行明确、具体分工的，并有一定程序要求的技术型、技能型工作。如机械制造、建筑、渔业、野外工作、工程技术等职业。（木匠、农民、操作X光的技师、工程师、飞机机械师、鱼类和野生动物专家、自动化技师、机械工（车工、钳工等）、电工、无线电报务员、火车司机、长途公共汽车司机、机械制图员、修理机器、电器师）",
    },
    CapacityCategoryInterpretation {
        capacity_category: CapacityCategory::I,
        name: "研究型",
        personality_trait: "也叫探索型。这个类型的人对自然现象和自然规律很感兴趣，喜欢同观念而不是同人或事务打交道，对工作有着极大的热情。他们的思维逻辑性较强，善于通过分析思考解决面临的难题，但并不一定实现具体的操作。喜欢面对疑问和不懈的挑战，不愿循规蹈矩，总是渴望创新。他们为人慎重而敏感，追求的是内在自我价值的实现，而非物质生活的质量。他们将自己描绘成“分析型的、内省的、独立的、好奇心强烈的和含蓄的”。",
        occupational_stigma: "善于通过观察和科学分析进行系统的创造性活动，一般的研究对象侧重于自然科学而不是社会科学方面。适合这类人的职业有生物学、物理学。气象学、天文学等自然科学方面的科学工作者，化学技师、实验研究人员，建筑设计师等，计算机程序设计员、工程师等。（气象学者、生物学者、天文学家、药剂师、动物学者、化学家、科学报刊编辑、地质学者、植物学者、物理学者、数学家、实验员、科研人员、科技作者）",
    },
    CapacityCategoryInterpretation {
        capacity_category: CapacityCategory::A,
        name: "艺术型",
        personality_trait: "艺术型的人有很强的自我表现欲，对自己十分自信，喜欢通过新颖的设计引起别人情感上的共呜。他们的想象力很丰富，创造力很强，喜欢凭直觉做出判断，感情丰富，容易冲动，甚至可以为追求心中的理想抛弃一切。但他们的生活也许是杂乱无章、缺少秩序的。艺术型的人可以描述为“独立不倚、创新求异、热衷表现、激情洋溢、感情丰富和理想主义”。",
        occupational_stigma: "善于通过非系统化的、自由的活动进行艺术表现，但精细的操作能力较差。相应职业有演员、影视工作人员、画家、歌唱家、音乐演奏家、诗人、作家，工艺美术设计人员等。（室内装饰专家、图书管理专家、摄影师、音乐教师、作家、演员、记者、诗人、作曲家、编剧、雕刻家、漫画家）",
    },
    CapacityCategoryInterpretation {
        capacity_category: CapacityCategory::S,
        name: "社会型",
        personality_trait: "社会型的人有较强的社会责任感和人道主义倾向，社会适应能力较强。他们善于与人交往，喜欢周围有别人存在，对别人的事很有兴趣，乐于帮助别人解决难题。这种人喜欢与人而不是与事物打交道。“助人为乐、有责任心、热情、开朗、友好、善良、易于合作”是对他们较好的描述。这类人喜欢社会交往性工作，如教师、医生、护士、公关人员、营销人员等。",
        occupational_stigma: "从事更多时间与人打交道的说服、教育和治疗工作。如教师、护士、心理学工作者，社会活动家等。（社会学者、导游、福利机构工作者、咨询人员、社会工作者、社会科学教师、学校领导、精神病工作者、公共保健护士）",
    },
    CapacityCategoryInterpretation {
        capacity_category: CapacityCategory::E,
        name: "企业型",
        personality_trait: "也叫事业型或管理型。这个类型的人充满自信，喜欢竞争和冒险。好成为领导者，好支配他人，善辞令，好与人争辩，总试图让别人接受自己的观点。他们不愿从事精细工作，不喜欢需要长期复杂思维的工作。不愿被人支配，不易与人合作。在别人眼中，他们是“敢做敢为的、信心百倍的、乐观的、冲动的、自我显示的、精力旺盛的”。",
        occupational_stigma: "适于从事需要胆略、冒风险和承担责任的活动。主要指管理、决策方面的工作。如经理、推销员、电视节目主持人、政治家等。（推销员、进货员、商品批发员、旅馆经理、饭店经理、广告宣传员、调度员、律师、政治家、零售商）",
    },
    CapacityCategoryInterpretation {
        capacity_category: CapacityCategory::C,
        name: "传统型",
        personality_trait: "传统型的人喜欢有秩序的、安稳的生活，做事有计划；乐于执行上级派下来的任务；讲求精确，不愿冒险；想象力和创造力较差。下面的形容词可以很好的描述他们“循规蹈矩、踏实稳当、忠实可靠、顺从听话”。他们与现实型的人区别在于他们对花大量体力和脑力的活动不感兴趣。",
        occupational_stigma: "传统型的人适于从事的工作有以下特点：严格按照固定的规则和方法进行的重复性、习惯性的活动，能够较快的见到自己的劳动成果，需要一定的自控能力。具体职业有会计、录入员、图书管理员、审计员、出纳员、秘书、邮递员、税务员、统计员等等。（记账员、法庭速记员、成本估算员、税务员、核算员、打字员、办公室职员、计算机操作员）",
    },
];
